app/controllers/students_controller.rb

  def show
    @student = Student.all[params[:id].to_i - 1]
---
SELECT "students".* FROM "students" WHERE (id = '1')